//L023_069
//Поиск строки в тексте
//Парфёнов Вячеслав, МЕН-243201 (ПМ-201) 30.09.2025
#include <iostream>
#include <cstring>
#include "L023_069.hpp"
using namespace std;

int findmatch(char* p, char* t) {
    int i, j;
    int plen, tlen;

    plen = strlen(p); // Длина образца
    tlen = strlen(t); // Длина текста

    // Основной цикл по всем возможным позициям начала образца в тексте
    for (i = 0; i <= (tlen - plen); i = i + 1) { // i - начальная позиция сравнения в тексте
        j = 0; // Индекс для перемещения по образцу

        // Проверка совпадения символов образца и текста
        while ((j < plen) && (t[i + j] == p[j])) {
            j = j + 1; // Переход к следующему символу образца
        }

        // Если весь образец совпал с частью текста
        if (j == plen) {
            return i; // Возвращение в позицию, где нашли образец
        }
    }
    return -1; // Образец не найден во всем тексте
}